controllers/CartController.php

	public function actionIndex()
    {
        /*if (Yii::$app->session['isLogin'] != 1) {
            return $this->redirect(['member/auth']);
        }
        $userid = User::find()->where('username = :name', [':name' => Yii::$app->session['loginname']])->one()->userid;
         */
        $userid = Yii::$app->user->id;
        $user=new user;
        $cart=new cart;
       // $username=yii::$app->session['User']['user'];
        //$userid=$user->find()->where("username=:username",[':username'=>$username])->one()->userid;
        $key='cart';
        $cache=yii::$app->cache->get($key);
        if (!$cache) {
        	$cart = Cart::find()->where('userid = :uid', [':uid' => $userid])->asArray()->all();
	        $data = [];
	        foreach ($cart as $k=>$pro) {
	            $product = Product::find()->where('productid = :pid', [':pid' => $pro['productid']])->one();
---
SELECT * FROM `shop_cart` WHERE userid = '1'
SELECT * FROM `shop_product` WHERE productid = '13'

	  public function actionMod()
    {
        $cartid = Yii::$app->request->get("cartid");
        $productnum = Yii::$app->request->get("productnum");
        //$updatetime=time();
        $model = Cart::find()->where('cartid=:cid',[':cid'=>$cartid])->one();
        if ($productnum==$model->productnum) {
        	return ;
        }
        $model->productnum=$productnum;
        $model->save();
---
SELECT * FROM `shop_cart` WHERE cartid='5'
UPDATE `shop_cart` SET `productnum`='4', `updatetime`=1517909915 WHERE `cartid`='5'