controllers/IndexController.php

	public function actionIndex(){

/*	$redis=yii::$app->cache;

	$redis->set('test',123);

	var_dump($redis->keys('*'));*/


	/*	$mail=yii::$app->mailer->compose('seekpass',['adminuser'=>'admin','time'=>time(),'token'=>'sldsd'])->setTo('280594803@qq.com')->setFrom('hkbmail@126.com')->setSubject('just for test');


		if ($mail->queue()) {
			echo  'yeah';exit;
		}*/
		/*echo '<pre>';
		print_r($mail);exit;
		echo '</pre>';*/
		//var_dump(yii::$app->user);exit;


		$model=Product::find();
		$where="onsale='1'";
		$res['tui'] = $model->Where($where . ' and isbest = \'1\'')->orderby('addtime desc')->limit(4)->asArray()->all();
		$res['new'] = $model->Where($where . ' and isnew = \'1\'')->orderby('addtime desc')->limit(4)->asArray()->all();
		$res['hot'] = $model->Where($where . ' and ishot = \'1\'')->orderby('addtime desc')->limit(4)->asArray()->all();
---
SELECT * FROM `shop_product` WHERE onsale='1' and isbest = '1' ORDER BY `addtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE onsale='1' and isnew = '1' ORDER BY `addtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE onsale='1' and ishot = '1' ORDER BY `addtime` DESC LIMIT 4