models/Category.php

    public function getMenu(){
        //顶级分类
        $cates=$this->find()->where("topid=:pid",[':pid'=>0])->asArray()->all();
        //二级分类
        $data=[];
        foreach ($cates as $key => $cate) {
            $cate['children']=self::find()->where('parentid=:pid',[':pid'=>$cate['cateid']])->asArray()->all();
---
SELECT * FROM `shop_category` WHERE topid=0
SELECT * FROM `shop_category` WHERE parentid='1'