models/User.php

SELECT * FROM `shop_user` WHERE `userid`='1'
---
	public static function findIdentity($userid){
		return static::findOne($userid);